recipes/beef-burgundy.org
#+title: Beef Burgundy
#+author: Florent Espanet
#+date: [2022-05-10 Tue]
#+html_link_home: /
#+html_link_up: /recipes/


* Beef Burgundy
** Ingredients

For 8 people:

| Ingredient         | Quantity |
|--------------------+----------|
| Beef Chuck         | 1kg      |
| Lardons            | 125g     |
| Small onions       | 12       |
| Butter             | 60g      |
| Carrots            | 500g     |
| Floor              | 1tbsp    |
| Tomato concentrate | 1tbsp    |
| Red wine           | 1L       |
| Garlic             | 2 cloves |
| Thyme              | 1 sprig  |
| Bay leaf           | 1        |
| Celery             | 2 stalks |
| Parsley            | 4 sprigs |


** Instructions

- Take the meat out of the refrigerator 1h30 before
- In a large pot:
  - Melt the butter
  - Add onions and lardons
  - Sauté for 2-3min
- Add salt and pepper on all sides of the meat
- Add the meat to the pot and brown it on all sides
- Cut the carrots in 5cm sticks and add to the meat
- Tie the thyme, bay leaf, celery and parsley together and add to the meat
- Sauté everything for 30min
- Take the meat out of the pot and keep it warm
- Add the floor in the pot and stir
- When the floor starts to color, add the tomato concentrate and stir
- Keep stiring and add the red wine slowly
- Crush the garlic and add to the pot
- The sauce should become smooth, at this point add the meat back
- Let it cook for at least 2h30 on lowest heat
  - Depending on the meat, it can take up to 5h to cook
  - Taste the meat every 30min after the 2h30 mark
  - It's ready when the meat can be pulled apart
