recipes/beef-burgundy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beef Burgundy</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/css/org.css" /> <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.1/css/brands.min.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/recipes/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Beef Burgundy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c438d3">Beef Burgundy</a>
<ul>
<li><a href="#orgf5c57b0">Ingredients</a></li>
<li><a href="#org857a05d">Instructions</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org9c438d3" class="outline-2">
<h2 id="org9c438d3">Beef Burgundy</h2>
<div class="outline-text-2" id="text-org9c438d3">
</div>
<div id="outline-container-orgf5c57b0" class="outline-3">
<h3 id="orgf5c57b0">Ingredients</h3>
<div class="outline-text-3" id="text-orgf5c57b0">
<p>
For 8 people:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ingredient</th>
<th scope="col" class="org-left">Quantity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Beef Chuck</td>
<td class="org-left">1kg</td>
</tr>

<tr>
<td class="org-left">Lardons</td>
<td class="org-left">125g</td>
</tr>

<tr>
<td class="org-left">Small onions</td>
<td class="org-left">12</td>
</tr>

<tr>
<td class="org-left">Butter</td>
<td class="org-left">60g</td>
</tr>

<tr>
<td class="org-left">Carrots</td>
<td class="org-left">500g</td>
</tr>

<tr>
<td class="org-left">Floor</td>
<td class="org-left">1tbsp</td>
</tr>

<tr>
<td class="org-left">Tomato concentrate</td>
<td class="org-left">1tbsp</td>
</tr>

<tr>
<td class="org-left">Red wine</td>
<td class="org-left">1L</td>
</tr>

<tr>
<td class="org-left">Garlic</td>
<td class="org-left">2 cloves</td>
</tr>

<tr>
<td class="org-left">Thyme</td>
<td class="org-left">1 sprig</td>
</tr>

<tr>
<td class="org-left">Bay leaf</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">Celery</td>
<td class="org-left">2 stalks</td>
</tr>

<tr>
<td class="org-left">Parsley</td>
<td class="org-left">4 sprigs</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org857a05d" class="outline-3">
<h3 id="org857a05d">Instructions</h3>
<div class="outline-text-3" id="text-org857a05d">
<ul class="org-ul">
<li>Take the meat out of the refrigerator 1h30 before</li>
<li>In a large pot:
<ul class="org-ul">
<li>Melt the butter</li>
<li>Add onions and lardons</li>
<li>Sauté for 2-3min</li>
</ul></li>
<li>Add salt and pepper on all sides of the meat</li>
<li>Add the meat to the pot and brown it on all sides</li>
<li>Cut the carrots in 5cm sticks and add to the meat</li>
<li>Tie the thyme, bay leaf, celery and parsley together and add to the meat</li>
<li>Sauté everything for 30min</li>
<li>Take the meat out of the pot and keep it warm</li>
<li>Add the flour in the pot and stir</li>
<li>When the flour starts to color, add the tomato concentrate and stir</li>
<li>Keep stiring and add the red wine slowly</li>
<li>Crush the garlic and add to the pot</li>
<li>The sauce should become smooth, at this point add the meat back</li>
<li>Let it cook for at least 2h30 on lowest heat
<ul class="org-ul">
<li>Depending on the meat, it can take up to 5h to cook</li>
<li>Taste the meat every 30min after the 2h30 mark</li>
<li>It's ready when the meat can be pulled apart</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-05-10 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
